zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_hb_flash.c
/***************************************************************************//**
* \file cy_smif_hb_flash.c
* \version 2.140.1
*
* \brief
*  This file provides the source code for the Hyper Bus APIs of the SMIF driver.
*
* Note:
*
********************************************************************************
* \copyright
* (c) 2021-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/
#include "cy_device.h"

#if defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION>=2)
#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */
#include "cy_smif_memslot.h"
#include <string.h>


/*****************************************************************************
Pattern that should be used to calibrate the delay of RWDS capturing
 *****************************************************************************/
 /* Length of the calibration data pattern (Cy_SMIF_HB_CalibrationDataPattern) for HyperBus in bytes */
#define CY_SMIF_HB_CALIBRATION_DATA_PATTERN_LENGTH    12U
static uint8_t Cy_SMIF_HB_CalibrationDataPattern[CY_SMIF_HB_CALIBRATION_DATA_PATTERN_LENGTH] = { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x10, 0x11 };
#define DEVICEREADY_CHECK_TIMEOUT 100U
static uint16_t writeBuf = 0x0000U;

/* private functions */
static void Cy_SMIF_HB_SetDummyCycles(volatile SMIF_DEVICE_Type *dev, cy_en_smif_hb_dev_type_t hbDevType, uint32_t dummyCycle);

static uint32_t Cy_SMIF_Reverse4ByteEndian(uint32_t in);


static cy_en_smif_status_t Cy_SMIF_HyperBus_MMIO_Read(SMIF_Type *base,
                                        cy_en_smif_slave_select_t slave,
                                        cy_en_hb_burst_type_t burstType,
                                        uint32_t readAddress,
                                        uint32_t sizeInHalfWord,
                                        uint16_t buf[],
                                        uint32_t dummyCycle,
                                        bool doubleLat,
                                        bool isblockingMode,
                                        cy_stc_smif_context_t *context);



/*******************************************************************************
* Function Name: Cy_SMIF_Reverse4ByteEndian
****************************************************************************//**
*
* This function reverses endianness of 32 bit input
*
* \param in
* input 32 bit data to be reversed its endianness
*
* \return 32 bit data which has been reversed its endianness
*
*******************************************************************************/
static uint32_t Cy_SMIF_Reverse4ByteEndian(uint32_t in)
{
    return ((in & 0xFF000000UL) >> 24UL) |
      ((in & 0x00FF0000UL) >> 8UL)  |
        ((in & 0x0000FF00UL) << 8UL)  |
          ((in & 0x000000FFUL) << 24UL);
}

/*******************************************************************************
* Function Name: Cy_SMIF_HyperBus_InitDevice
****************************************************************************//**
*
* This function sets up SMIF registers which is used in XIP mode for hyper bus
* memory.
*
* base: Holds the base address of the SMIF base registers.
*
* memCfg: Configuration to be applied to the SMIF device \ref cy_stc_smif_mem_config_t
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_InitDevice(SMIF_Type *base, const cy_stc_smif_mem_config_t *memCfg, cy_stc_smif_context_t *context)
{
    cy_stc_smif_hbmem_device_config_t *config = memCfg->hbdeviceCfg;
    SMIF_DEVICE_Type volatile * dev = Cy_SMIF_GetDeviceBySlot(base, memCfg->slaveSelect);

#if (CY_IP_MXSMIF_VERSION>=4)
    /* DDR_PIPELINE_POS_DAT should be SET for RX Capture mode xSPI */
    if (_FLD2VAL(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (SMIF_CTL2(base))) == (uint32_t)CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS)
    {
        SMIF_DEVICE_RX_CAPTURE_CONFIG(dev) |= _VAL2FLD(SMIF_CORE_DEVICE_RX_CAPTURE_CONFIG_DDR_PIPELINE_POS_DAT, 1U);
    }
#endif
    /* Check if SMIF XIP is enabled */
    if ((_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 1U) && (0U != (context->flags & CY_SMIF_FLAG_MEMORY_MAPPED)))
    {

        /****************************/
        /*   Set XIP Read Sequence  */
        /****************************/

        SMIF_DEVICE_RD_CMD_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_CODE,    (uint32_t)config->xipReadCmd)  |
                                        _VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_DDR_MODE,  CY_SMIF_DDR)  |
                                        _VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_RD_CMD_CTL_PRESENT2, CY_SMIF_PRESENT_1BYTE));

        SMIF_DEVICE_RD_ADDR_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_ADDR_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_RD_ADDR_CTL_DDR_MODE, CY_SMIF_DDR));

        SMIF_DEVICE_RD_MODE_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_MODE_CTL_CODE,  0UL)       |
                                        _VAL2FLD(SMIF_DEVICE_RD_MODE_CTL_WIDTH, CY_SMIF_WIDTH_SINGLE) |
                                        _VAL2FLD(SMIF_DEVICE_RD_MODE_CTL_DDR_MODE, CY_SMIF_SDR) |
                                        _VAL2FLD(SMIF_DEVICE_RD_MODE_CTL_PRESENT2, CY_SMIF_NOT_PRESENT));

        SMIF_DEVICE_RD_DATA_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_DATA_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_RD_DATA_CTL_DDR_MODE, CY_SMIF_DDR));



