zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_hb_flash.c
        /*****************************/
        /*   Set XIP Write Sequence  */
        /*****************************/
        SMIF_DEVICE_WR_CMD_CTL(dev) = ( _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_CODE,  config->xipWriteCmd) |
                                        _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_DDR_MODE, CY_SMIF_DDR) |
                                        _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_PRESENT2, CY_SMIF_PRESENT_1BYTE));

        SMIF_DEVICE_WR_ADDR_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_WR_ADDR_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_WR_ADDR_CTL_DDR_MODE, CY_SMIF_DDR));

        SMIF_DEVICE_WR_MODE_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_WR_MODE_CTL_CODE,    0UL)      |
                                        _VAL2FLD(SMIF_DEVICE_WR_MODE_CTL_WIDTH, CY_SMIF_WIDTH_SINGLE) |
                                        _VAL2FLD(SMIF_DEVICE_WR_MODE_CTL_DDR_MODE, CY_SMIF_SDR) |
                                        _VAL2FLD(SMIF_DEVICE_WR_MODE_CTL_PRESENT2,CY_SMIF_NOT_PRESENT));

        SMIF_DEVICE_WR_DATA_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_WR_DATA_CTL_WIDTH, CY_SMIF_WIDTH_OCTAL) |
                                        _VAL2FLD(SMIF_DEVICE_WR_DATA_CTL_DDR_MODE, CY_SMIF_DDR));

        SMIF_DEVICE_ADDR(dev) = (SMIF_DEVICE_ADDR_ADDR_Msk & memCfg->baseAddress);

        /* Convert the size in the mask */
        SMIF_DEVICE_MASK(dev)= SMIF_DEVICE_MASK_MASK_Msk & (~((uint32_t)(config->memSize)) + 1UL);

        SMIF_DEVICE_ADDR_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_ADDR_CTL_SIZE3, CY_SMIF_XIP_ADDRESS_5_BYTE) |
                                    _VAL2FLD(SMIF_DEVICE_ADDR_CTL_DIV2, 0U));
    }

#if (CY_IP_MXSMIF_VERSION>=4)
    if (_FLD2VAL(SMIF_CORE_CTL2_RX_CAPTURE_MODE, (SMIF_CTL2(base))) == (uint32_t)CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS)
    {
        Cy_SMIF_HB_SetDummyCycles(dev, config->hbDevType, config->dummyCycles - 1U);
    }
    else
    {
        Cy_SMIF_HB_SetDummyCycles(dev, config->hbDevType, config->dummyCycles);
    }
#else
    /* Note: All read/write sequence settings depending on the dummy cycles are moved to the following function   */
    /*       because it may be necessary to update them during runtime when the latency settings in the connected */
    /*       memories have been changed. Cy_SMIF_HB_SetDummyCycles can then be used for that purpose.             */
    Cy_SMIF_HB_SetDummyCycles(dev, config->hbDevType, config->dummyCycles -1U);
#endif
    context->dummyCycles = config->dummyCycles;

    context->preXIPDataRate = CY_SMIF_DDR;

    /* The device control register initialization */
    SMIF_DEVICE_CTL(dev) = _VAL2FLD(SMIF_DEVICE_CTL_WR_EN, 1U) |
                  _VAL2FLD(SMIF_DEVICE_CTL_CRYPTO_EN, 0U) |
                  _VAL2FLD(SMIF_DEVICE_CTL_DATA_SEL,  CY_SMIF_DATA_SEL0) |
                  _VAL2FLD(SMIF_DEVICE_CTL_MERGE_EN,  ((bool)(memCfg->flags & CY_SMIF_FLAG_MERGE_ENABLE))? 1U : 0U)  |
                  _VAL2FLD(SMIF_DEVICE_CTL_MERGE_TIMEOUT,  (uint32_t)memCfg->mergeTimeout) |
                  SMIF_DEVICE_CTL_ENABLED_Msk;

    return CY_SMIF_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_SMIF_HB_SetDummyCycles
****************************************************************************//**
*
* This function updates the dummy cycles in the XIP read/write sequences
* based on the specified latency code and device type.
* If called for and already initialized device during runtime (e.g. after
* updating the latency settings in the connected memory) ensure that SMIF is
* not busy and no access to XIP address space happens!
*
* dev
* Holds the base address of the SMIF Device registers.
*
* hbDevType
* Device type (HyperFlash or HyperRAM)
*
* dummyCycle
* The amount of dummy cycles to use
*
* return
*     - \ref CY_SMIF_SUCCESS
*
*******************************************************************************/
static void Cy_SMIF_HB_SetDummyCycles(volatile SMIF_DEVICE_Type *dev, cy_en_smif_hb_dev_type_t hbDevType, uint32_t dummyCycle)
{
    /**********************************************/
    /*   Set dummy cycles for XIP Read Sequence  */
    /**********************************************/

    /*** Set dummy ***/
    {
        /* For Hyperbus, (RD DUMMY_CTL SIZE5 + 2) = initial latency */
        SMIF_DEVICE_RD_DUMMY_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_DUMMY_CTL_SIZE5, (dummyCycle - 1UL)) |
                                         _VAL2FLD(SMIF_DEVICE_RD_DUMMY_CTL_PRESENT2, 1U));

    }

    /***  Set bound  ***/
    {
        SMIF_DEVICE_RD_BOUND_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_RD_BOUND_CTL_SIZE5, dummyCycle) |
                                         _VAL2FLD(SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_SIZE,SUB_PAGE_SIZE_16BYTE)  |
                                         _VAL2FLD(SMIF_DEVICE_RD_BOUND_CTL_SUB_PAGE_NR,SUB_PAGE_2_PER_PAGE) |
                                         _VAL2FLD(SMIF_DEVICE_RD_BOUND_CTL_SUBSEQ_BOUND_EN,0UL)  |
                                         _VAL2FLD(SMIF_DEVICE_RD_BOUND_CTL_PRESENT, 1UL));
    }

    /**********************************************/
    /*   Set dummy cycles for XIP Write Sequence  */
    /**********************************************/
    /*** Set dummy ***/
    {
        if(hbDevType == CY_SMIF_HB_FLASH)
        {
            SMIF_DEVICE_WR_DUMMY_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_SIZE5, 0UL) |
                                             _VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2, CY_SMIF_NOT_PRESENT) |
                                             _VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN, 0UL));
        }
        else
        {
            // For Hyperbus, (RD DUMMY_CTL SIZE5 + 2) = initial latency
            SMIF_DEVICE_WR_DUMMY_CTL(dev) = (_VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_SIZE5, (dummyCycle - 1U)) |
                                         _VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_PRESENT2, 1U) |
                                         _VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_RWDS_EN, 1UL));
        }
    }
    return;
}

