zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_hb_flash.c
/*******************************************************************************
* Function Cy_SMIF_HyperBus_Read
****************************************************************************//**
*
* This function reads data from hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* SMIF memory configuration structure for memory mode of operation.
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param readAddress
* Specifies address of external device to be read.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param dummyCycles
* Number of dummy cycles required before actual read data.
*
* \param doubleLat
* double initial latency or single initial latency
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_Read(SMIF_Type *base,
                                        const cy_stc_smif_mem_config_t *memConfig,
                                        cy_en_hb_burst_type_t burstType,
                                        uint32_t readAddress,
                                        uint32_t sizeInHalfWord,
                                        uint16_t buf[],
                                        uint32_t dummyCycles,
                                        bool doubleLat,
                                        bool isblockingMode,
                                        cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    status = Cy_SMIF_HyperBus_MMIO_Read(base,
                                 memConfig->slaveSelect,
                                 burstType,
                                 readAddress,
                                 sizeInHalfWord,
                                 buf,
                                 dummyCycles,
                                 doubleLat,
                                 isblockingMode,
                                 context
                                 );
    return status;
}

/*******************************************************************************
* Function Cy_SMIF_HyperBus_Write
****************************************************************************//**
*
* This function writes data into hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memconfig
* * SMIF memory configuration structure for memory mode of operation.
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param writeAddress
* Specifies address of external device to be write.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param hbDevType
* Specifies hyper bus type. FLASH or SRAM. \ref cy_en_smif_hb_dev_type_t
*
* \param dummyCycles
* Number of dummyCycles to be inserted before write operation.
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_Write(SMIF_Type *base,
                                        const cy_stc_smif_mem_config_t *memConfig,
                                        cy_en_hb_burst_type_t burstType,
                                        uint32_t writeAddress,
                                        uint32_t sizeInHalfWord,
                                        uint16_t buf[],
                                        cy_en_smif_hb_dev_type_t hbDevType,
                                        uint32_t dummyCycles,
                                        bool isblockingMode,
                                        cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status = CY_SMIF_GENERAL_ERROR;
    uint32_t i_WriteAddr = 0U;

    for(uint32_t i = 0U; i < sizeInHalfWord; i++)
    {
        if(hbDevType == CY_SMIF_HB_FLASH)
        {
           writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA1;
           status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                memConfig->slaveSelect,
                                burstType,
                                (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                HB_REG_SIZE_IN_HALFWORD,
                                &writeBuf,
                                hbDevType,
                                dummyCycles,
                                isblockingMode,
                                context
                                );
        
           writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_DATA2;
           status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                memConfig->slaveSelect,
                                burstType,
                                (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR2,
                                HB_REG_SIZE_IN_HALFWORD,
                                &writeBuf,
                                hbDevType,
                                dummyCycles,
                                isblockingMode,
                                context
                                );
        
           writeBuf = (uint16_t)CY_SMIF_NOR_UNLOCK_BYPASS_PROGRAM_CMD;
           status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                memConfig->slaveSelect,
                                burstType,
                                (uint32_t)CY_SMIF_HB_FLASH_UNLOCK_ADDR1,
                                HB_REG_SIZE_IN_HALFWORD,
                                &writeBuf,
                                hbDevType,
                                dummyCycles,
                                isblockingMode,
                                context
                                );
           if (status != CY_SMIF_SUCCESS)
           {
               return status;
           }
        }
        status = Cy_SMIF_HyperBus_MMIO_Write(base,
                                memConfig->slaveSelect,
                                burstType,
                                i_WriteAddr + writeAddress,
                                1U,
                                (uint16_t*)&buf[i_WriteAddr],
                                hbDevType,
                                dummyCycles,
                                isblockingMode,
                                context
                                );
        
        if(hbDevType == CY_SMIF_HB_FLASH)
        {
            uint16_t readStatus = 0x0000U;
            uint16_t timeout = DEVICEREADY_CHECK_TIMEOUT;
            do
            {
                status = CY_SMIF_HyperBus_ReadStatus(base, memConfig, &readStatus,context  );
                timeout --;
                Cy_SysLib_Delay(100U);
            } while(((readStatus & (uint16_t)CY_SMIF_DEV_RDY_MASK) == 0U) && (timeout > 0U)); // wait for the device becoming ready
            if(timeout == 0U)
            {
                return CY_SMIF_EXCEED_TIMEOUT;
            }
        }
        i_WriteAddr++;
    }
    return status;
}

