zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_hb_flash.c
    if(dummyCycle > 0u)
    {
        status = Cy_SMIF_SendDummyCycles_Ext(base, CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, dummyCycle - 1U);

        if(status != CY_SMIF_SUCCESS)
        {
            return status;
        }
    }

    if(isblockingMode == true)
    {
        status = Cy_SMIF_ReceiveDataBlocking_Ext(base, (uint8_t *)buf, (sizeInHalfWord*2u), CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, context);
    }
    else
    {
        status = Cy_SMIF_ReceiveData_Ext(base, (uint8_t *)buf, (sizeInHalfWord*2u), CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, NULL, context);
    }

    return status;
}

/*******************************************************************************
* Function Cy_SMIF_HyperBus_MMIO_Write
****************************************************************************//**
*
* This function writes data into hyper bus memory in MMIO mode.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slave
* Specifies slave of external device to be read. \ref cy_en_smif_slave_select_t
*
* \param burstType
* Specifies wrapped or continuous burst. \ref en_hb_bust_type_t
*
* \param readAddress
* Specifies address of external device to be read.
*
* \param sizeInHalfWord
* Specifies memory size to be read.
* Note hyper bus memory have 16bit data per each address.
*
* \param buf
* Pointer to buffer where read data to be stored
*
* \param hbDevType
* Specifies hyper bus type. FLASH or SRAM. \ref cy_en_smif_hb_dev_type_t
*
* \param lcCode
* Latency code. This value should be set also to the hyper bus device.
*
* \param isblockingMode
* Blocking mode or not. if this is true, process waits for the read finished in this
* function. unless, the process does not wait and exit function.
*
* \param context
* Passes a configuration structure that contains the transfer parameters of the
* SMIF block.
*
* \return \ref cy_en_smif_status_t
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_HyperBus_MMIO_Write(SMIF_Type *base,
                                        cy_en_smif_slave_select_t slave,
                                        cy_en_hb_burst_type_t burstType,
                                        uint32_t writeAddress,
                                        uint32_t sizeInHalfWord,
                                        uint16_t buf[],
                                        cy_en_smif_hb_dev_type_t hbDevType,
                                        uint32_t dummyCycle,
                                        bool isblockingMode,
                                        cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t status;
    (void)hbDevType;

    uint32_t pageAddr = ((uint32_t)(writeAddress >> 3u) & 0x00FFFFFFU);
    uint16_t addr_first_2bytes = (uint16_t)(pageAddr);
    // THis is the last 8 bits of the 24 bit address. this should go in as part of command
    uint8_t addr_last_byte = (uint8_t)((pageAddr >> 16u));

    uint32_t address = (uint32_t)( _VAL2FLD(SMIF_HYPERBUS_ADR_LOWER_COL_ADDRESS,    writeAddress) |
                         _VAL2FLD(SMIF_HYPERBUS_ADR_BYTE_ENABLE,    0x0U) |
                         _VAL2FLD(SMIF_HYPERBUS_ADR_ROW_AND_UPPER_COL_ADDRESS, addr_first_2bytes));
    uint32_t revOfAddr = Cy_SMIF_Reverse4ByteEndian(address);

    uint8_t param_addr[4];
    ValueToByteArray(revOfAddr, param_addr, 0u, 4U);
    uint16_t cmd = (uint16_t)( _VAL2FLD(SMIF_HYPERBUS_CMD_ADDRESS_LAST_BYTE,    addr_last_byte) |
                               _VAL2FLD(SMIF_HYPERBUS_CMD_BURST_TYPE,    burstType) |
                               _VAL2FLD(SMIF_HYPERBUS_CMD_TARGET_TYPE, CY_SMIF_HB_TARGET_MEMORY) |
                               _VAL2FLD(SMIF_HYPERBUS_CMD_READ_WRITE,    CY_SMIF_HB_WRITE));

    /****** Command and Address ******/
   status = Cy_SMIF_TransmitCommand_Ext(base,
                                        cmd,
                                        true,
                                        CY_SMIF_WIDTH_OCTAL,
                                        CY_SMIF_DDR,
                                        (uint8_t*)&revOfAddr,
                                        4u,
                                        CY_SMIF_WIDTH_OCTAL,
                                        CY_SMIF_DDR,
                                        slave,
                                        CY_SMIF_TX_NOT_LAST_BYTE,
                                        context);
    if(status != CY_SMIF_SUCCESS)
    {
        return status;
    }

    if(hbDevType == CY_SMIF_HB_SRAM)
    {
        if(dummyCycle > 0u)
        {
#if (CY_IP_MXSMIF_VERSION>=2)
            status = Cy_SMIF_SendDummyCycles_With_RWDS(base, false, false, dummyCycle - 1U);
#else
            status = Cy_SMIF_SendDummyCycles_Ext(base, CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, dummyCycle - 1U);
#endif

            if(status != CY_SMIF_SUCCESS)
            {
                return status;
            }
        }
    }
    if(isblockingMode)
    {
        status = Cy_SMIF_TransmitDataBlocking_Ext(base, (uint8_t *)buf, (sizeInHalfWord*2u), CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, context);
    }
    else
    {
        status = Cy_SMIF_TransmitData_Ext(base, (uint8_t const *)buf, (sizeInHalfWord*2u), CY_SMIF_WIDTH_OCTAL, CY_SMIF_DDR, NULL, context);
    }

    return status;
}

#if defined(__cplusplus)
}
#endif
#endif /* defined (CY_IP_MXSMIF) && (CY_IP_MXSMIF_VERSION>=2) && (CY_IP_MXSMIF_VERSION <= 5) */
